package algorithm

import (
	"testing"
)

func TestArrangeGroup(t *testing.T) {
	people := []string{"안석우", "강동희", "김병수", "김서영", "김영철", "송유진", "송현영", "심소연", "윤이슬", "윤준호", "이동구", "이동재", "전혜원", "최재호"}
	friends := map[string][]string{
		"안석우": {"강동희", "김서영", "송현영", "윤이슬", "이동구", "이동재"},
		"강동희": {"안석우", "송현영", "윤이슬", "이동구", "이동재"},
		"김병수": {"김영철"},
		"김서영": {"안석우", "윤이슬"},
		"김영철": {"김병수"},
		"송현영": {"안석우", "강동희", "윤이슬", "이동구", "이동재"},
		"윤이슬": {"안석우", "강동희", "김서영", "송현영", "이동구", "이동재"},
		"이동구": {"안석우", "강동희", "송현영", "윤이슬", "이동재"},
		"이동재": {"안석우", "강동희", "송현영", "윤이슬", "이동구"},
	}

	// 자리 배치 실행
	seating := assignSeats(people, friends)

	printSeatingArrangement(seating)
}
